# Импорт библиотек
import sqlite3

# Данные для записи в БД
projects = [
    ('2020-01-01', '2020-01-02'),
    ('2020-01-02', '2020-01-03'),
    ('2020-01-03', '2020-01-04'),
    ('2020-01-04', '2020-01-05'),
    ('2020-01-06', '2020-01-07'),
    ('2020-01-16', '2020-01-17'),
    ('2020-01-17', '2020-01-18'),
    ('2020-01-18', '2020-01-19'),
    ('2020-01-19', '2020-01-20'),
    ('2020-01-21', '2020-01-22'),
    ('2020-01-26', '2020-01-27'),
    ('2020-01-27', '2020-01-28'),
    ('2020-01-28', '2020-01-29'),
    ('2020-01-29', '2020-01-30')
]

try:
    # Создаем соединение
    con = sqlite3.connect("projects.sqlite")
    # Создаем курсор
    cur = con.cursor()
    # Создаем таблицу
    cur.execute("""CREATE TABLE IF NOT EXISTS projects (
                    proj_id INTEGER PRIMARY KEY AUTOINCREMENT,
                    proj_start TEXT,
                    proj_end TEXT)""")
    # Добавляем записи
    cur.executemany("INSERT INTO projects VALUES(NULL, ?,?)", projects)
    # Сохраняем транзакцию
    con.commit()
    # Закрываем курсор
    cur.close()
except sqlite3.Error as err:
    print("Ошибка выполнения запроса", err)
finally:
    # Закрываем соединение
    con.close()
    print("Соединение успешно закрыто")
